<a href="https://colab.research.google.com/github/Denise-Pro/Curso-Analise-de-Dados-Minas-Programam/blob/main/NoteBook_m%C3%A2o_na_massa_que_fizemos_juntas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [13]:
df = pd.read_csv('/content/sample_data/def_area_2004_2019.csv')
df.head(2)

   Ano/Estados   AC    AM  AP   MA     MT    PA    RO   RR   TO  AMZ LEGAL
0         2004  728  1232  46  755  11814  8870  3858  311  158      27772
1         2005  592   775  33  922   7145  5899  3244  133  271      19014

In [14]:
df.rename(columns={"AMZ LEGAL": "Area"}, inplace=True)
# df.rename(columns={"AM": "Am", "AP": "Ap"}, inplace=True)

In [17]:
df.head()

   Ano/Estados   AC    AM   AP    MA     MT    PA    RO   RR   TO   Area
0         2004  728  1232   46   755  11814  8870  3858  311  158  27772
1         2005  592   775   33   922   7145  5899  3244  133  271  19014
2         2006  398   788   30   674   4333  5659  2049  231  124  14286
3         2007  184   610   39   631   2678  5526  1611  309   63  11651
4         2008  254   604  100  1271   3258  5607  1136  574  107  12911

In [27]:
# Qual a àrea total desmatada desde 2004?

variavel = df.sum()
variavel[10]
variavel[-1]

# df.sum()
# [1,2,3]
# type(variavel)

162339

In [20]:
# df.sum()

df.loc[]

Ano/Estados    True
AC             True
AM             True
AP             True
MA             True
MT             True
PA             True
RO             True
RR             True
TO             True
Area           True
Name: Ano/Estados, dtype: bool

Quanto houve de desmatamento entre os anos 2009 e 2019 no Estado que compreende a maior área devastada?

In [38]:
# estado com maior area desmatada

estadoMaisDesmatado = df.sum().sort_values(ascending=False)

# type(estadoMaisDesmatado)
estadoMaisDesmatado = estadoMaisDesmatado[1]

In [48]:
# filtrando dados entre 2009 e 2019 

# df.loc[df['Ano/Estados'] >= 2009]


# filtrando dados entre 2008 e 2013

# df.loc[(df['Ano/Estados'] == 2008) | (df['Ano/Estados'] == 2013)]

df.loc[(df['Ano/Estados'] >= 2008) & (df['Ano/Estados'] <= 2013)]

   Ano/Estados   AC   AM   AP    MA    MT    PA    RO   RR   TO   Area
4         2008  254  604  100  1271  3258  5607  1136  574  107  12911
5         2009  167  405   70   828  1049  4281   482  121   61   7464
6         2010  259  595   53   712   871  3770   435  256   49   7000
7         2011  280  502   66   396  1120  3008   865  141   40   6418
8         2012  305  523   27   269   757  1741   773  124   52   4571
9         2013  221  583   23   403  1139  2346   932  170   74   5891

In [55]:
df1 = df.loc[df['Ano/Estados'] >= 2009]
# df1.sum()
variavel = df1.sum().sort_values(ascending=False)
variavel = variavel[1:]

In [56]:
# esse é o valor que corresponde ao quanto houve de desmatamento entre o período de 2009 e 2019 no estado com a maior área desmatada total
variavel[0]

31217